file1.txt

package com.adcb.rb.soap.template.generated;

import com.adcb.mobapp.base.enums.BaseSOAPReqXMLTypeEnum;

public class AddSendSMSEmail_Oper extends RBGeneratedTemplate {
	
	public static final String i_customerID = "customerID";
	public static final String i_transactionType = "transactionType";
	public static final String i_sendAsChannel = "sendAsChannel";
	public static final String i_smsTemplateID = "smsTemplateID";
	public static final String i_smsTextValues = "smsTextValues";
	public static final String i_emailTemplateID = "emailTemplateID";
	public static final String i_emailTextValues = "emailTextValues";
	public static final String i_emailAddress = "emailAddress";
	public static final String i_flexiFiller3 = "flexiFiller3";
	
	public static final String o_SMSRes = "SMSRes";
	public static final String o_status = "status";
	public static final String o_reason = "reason";
	
	
	
	
	@Override
	public String getReqTemplate() {

		return "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:add=\"http://www.adcb.com/esb/mnt/NonCard/AddSendSMSEmail.xsd\" xmlns:head=\"http://www.adcb.com/esb/common/header.xsd\">\r\n" + 
				"   <soapenv:Header/>\r\n" + 
				"   <soapenv:Body>\r\n" + 
				"      <add:SRSMSServiceReqMsg>\r\n" + 
				"         <head:header>\r\n" + 
				"            <head:serviceName>AddSendSMSEmail</head:serviceName>\r\n" + 
				"            <head:versionNo>1.0</head:versionNo>\r\n" + 
				"            <head:serviceAction>Addition</head:serviceAction>\r\n" + 
				"            <head:sysRefNumber>#sysRefNumber#</head:sysRefNumber>\r\n" + 
				"            <head:senderID>#senderID#</head:senderID>\r\n" + 
				"            <head:reqTimeStamp>#reqTimeStamp#</head:reqTimeStamp>\r\n" + 
				"            <head:username>#username#</head:username>\r\n" + 
				"            <head:credentials>#credentials#</head:credentials>\r\n" + 
				"         </head:header>\r\n" + 
				"         <add:SMSServiceReq>\r\n" + 
				"            <add:SMSReq>\r\n" + 
				"               <add:customerID>#customerID#</add:customerID>\r\n" + 
				"               <add:languagePref>#languagePref#</add:languagePref>\r\n" + 
				"               <add:acctNumber>#acctNumber#</add:acctNumber>\r\n" + 
				"               <add:transactionType>#transactionType#</add:transactionType>\r\n" + 
				"               <add:sendAsChannel>#sendAsChannel#</add:sendAsChannel>\r\n" + 
				"               <add:smsTemplateID>#smsTemplateID#</add:smsTemplateID>\r\n" + 
				"               <add:smsTextValues>#smsTextValues#</add:smsTextValues>\r\n" + 
				"               <add:mobileNumber>#mobileNumber#</add:mobileNumber>\r\n" + 
				"               <add:emailTemplateID>#emailTemplateID#</add:emailTemplateID>\r\n" + 
				"               <add:emailTextValues>#emailTextValues#</add:emailTextValues>\r\n" + 
				"               <add:emailAddress>#emailAddress#</add:emailAddress>\r\n" + 
				"               <add:flexiFiller1>#flexiFiller1#</add:flexiFiller1>\r\n" + 
				"               <add:flexiFiller2>#flexiFiller2#</add:flexiFiller2>\r\n" + 
				"               <add:flexiFiller3>#flexiFiller3#</add:flexiFiller3>\r\n" + 
				"               <add:flexiFiller4>#flexiFiller4#</add:flexiFiller4>\r\n" + 
				"               <add:flexiFiller5>#flexiFiller5#</add:flexiFiller5>\r\n" + 
				"            </add:SMSReq>\r\n" + 
				"         </add:SMSServiceReq>\r\n" + 
				"      </add:SRSMSServiceReqMsg>\r\n" + 
				"   </soapenv:Body>\r\n" + 
				"</soapenv:Envelope>";
	}

	@Override
	public String getResTemplate() {
		return "{\r\n" + 
				"	\"add_send_sms_email\": [\r\n" + 
				"	{\"fieldKey\": \"SMSRes\",	\"Collection\": \"\",		\"exp\": \"//ns0:SMSRes\"},\r\n" + 
				"	{\"fieldKey\": \"customerID\",	\"Collection\": \"SMSRes\",		\"exp\": \"//customerID\"},\r\n" + 
				"	{\"fieldKey\": \"acctNumber\",	\"Collection\": \"SMSRes\",		\"exp\": \"//acctNumber\"},\r\n" + 
				"	{\"fieldKey\": \"status\",	\"Collection\": \"SMSRes\",		\"exp\": \"//status\"},\r\n" + 
				"	{\"fieldKey\": \"reason\",	\"Collection\": \"SMSRes\",		\"exp\": \"//reason\"}\r\n" + 
				"	]\r\n" + 
				"}";
	}

	@Override
	public BaseSOAPReqXMLTypeEnum getReqXMLType() {
		return BaseSOAPReqXMLTypeEnum.PLAIN_XML;
	}

}
